In [1]:
import sqlite3 as sql

In [2]:
conn = sql.connect("dw_mp1.db")

In [3]:
cursor = conn.cursor()

In [4]:
import pandas as pd

In [9]:
dataFrameQueryAll = pd.read_sql_query('SELECT * FROM sales', conn)
dataFrameQueryAll

,Product_ID,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country
0,10000,1/1/09 4:24,Product3,7500,Amex,Pamela,Skaneateles,NY,United States
1,10001,1/8/09 11:55,Product1,1200,Diners,julie,Haverhill,England,United Kingdom
2,10002,1/12/09 21:30,Product1,1200,Visa,Julia,Madison,WI,United States

In [12]:
sales_information = [(10003,'1/26/09 13:41','Product1',1200,'Mastercard','Lesleigh','Baden','Aargau','Switzerland'),
                  (10004,'1/20/09 10:42','Product2',3600,'Diners','esther','Huddersfield','England','United Kingdom'),
                  (10005,'1/22/09 14:25','Product1',1200,'Visa','Hans-Joerg','Belfast','Northern Ireland','United Kingdom'),
                  (10006,'1/28/09 5:36','Product2',3600,'Visa','Christiane','Black River','Black River','Mauritius')]

In [13]:
cursor.executemany("INSERT INTO sales VALUES(?, ?, ?, ?, ?, ?, ?, ? ,?)", sales_information)

In [14]:
conn.commit()

In [15]:
cursor.execute("SELECT * FROM sales WHERE Product_ID BETWEEN 10000 AND 10003")

In [16]:
cursor.fetchall()

[(10000,
  '1/1/09 4:24',
  'Product3',
  7500,
  'Amex',
  'Pamela',
  'Skaneateles',
  'NY',
  'United States'),
 (10001,
  '1/8/09 11:55',
  'Product1',
  1200,
  'Diners',
  'julie',
  'Haverhill',
  'England',
  'United Kingdom'),
 (10002,
  '1/12/09 21:30',
  'Product1',
  1200,
  'Visa',
  'Julia',
  'Madison',
  'WI',
  'United States'),
 (10003,
  '1/26/09 13:41',
  'Product1',
  1200,
  'Mastercard',
  'Lesleigh',
  'Baden',
  'Aargau',
  'Switzerland')]

In [17]:
cursor.execute("SELECT * FROM sales")

In [18]:
cursor.fetchall()

[(10000,
  '1/1/09 4:24',
  'Product3',
  7500,
  'Amex',
  'Pamela',
  'Skaneateles',
  'NY',
  'United States'),
 (10001,
  '1/8/09 11:55',
  'Product1',
  1200,
  'Diners',
  'julie',
  'Haverhill',
  'England',
  'United Kingdom'),
 (10002,
  '1/12/09 21:30',
  'Product1',
  1200,
  'Visa',
  'Julia',
  'Madison',
  'WI',
  'United States'),
 (10003,
  '1/26/09 13:41',
  'Product1',
  1200,
  'Mastercard',
  'Lesleigh',
  'Baden',
  'Aargau',
  'Switzerland'),
 (10004,
  '1/20/09 10:42',
  'Product2',
  3600,
  'Diners',
  'esther',
  'Huddersfield',
  'England',
  'United Kingdom'),
 (10005,
  '1/22/09 14:25',
  'Product1',
  1200,
  'Visa',
  'Hans-Joerg',
  'Belfast',
  'Northern Ireland',
  'United Kingdom'),
 (10006,
  '1/28/09 5:36',
  'Product2',
  3600,
  'Visa',
  'Christiane',
  'Black River',
  'Black River',
  'Mauritius')]

In [19]:
cursor.execute("SELECT Name, City FROM sales")

In [20]:
cursor.fetchall()

[('Pamela', 'Skaneateles'),
 ('julie', 'Haverhill'),
 ('Julia', 'Madison'),
 ('Lesleigh', 'Baden'),
 ('esther', 'Huddersfield'),
 ('Hans-Joerg', 'Belfast'),
 ('Christiane', 'Black River')]

In [24]:
cursor.execute("SELECT Product, Payment_Type FROM sales WHERE price < 3000")

In [25]:
cursor.fetchall()

[('Product1', 'Diners'),
 ('Product1', 'Visa'),
 ('Product1', 'Mastercard'),
 ('Product1', 'Visa')]

In [59]:
df_csv = pd.read_csv('Sales - Sales.csv', header=None)
df_csv

,0,1,2,3,4,5,6,7,8
0,Product_ID,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country
1,10007,01/02/2009 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom
2,10008,01/02/2009 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States
3,10009,01/02/2009 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States
4,10010,01/03/2009 14:44,Product1,1200,Visa,Gouya,Echuca,Victoria,Australia
...,...,...,...,...,...,...,...,...,...
987,10993,01/07/2009 17:48,Product1,1200,Mastercard,Alex,Augusta,GA,United States
988,10994,1/23/09 12:42,Product2,3600,Mastercard,Anke,Avalon,New South Wales,Australia
989,10995,01/07/2009 19:48,Product2,3600,Mastercard,TRICIA,Sydney,New South Wales,Australia
990,10996,1/26/09 11:19,Product1,1200,Mastercard,smith,Lahti,Etela-Suomen Laani,Finland
991,10997,01/05/2009 13:23,Product1,1200,Visa,Macy,Inner City,Vienna,Austria

In [27]:
df_csv.to_sql(name = 'sales', con = conn, index = False, if_exists = 'append')

In [55]:
cursor.execute("SELECT * FROM sales WHERE Product_ID BETWEEN 10000 AND 10009")

In [56]:
cursor.fetchall()

[(10000,
  '1/1/09 4:24',
  'Product3',
  7500,
  'Amex',
  'Pamela',
  'Skaneateles',
  'NY',
  'United States'),
 (10001,
  '1/8/09 11:55',
  'Product1',
  1200,
  'Diners',
  'julie',
  'Haverhill',
  'England',
  'United Kingdom'),
 (10002,
  '1/12/09 21:30',
  'Product1',
  1200,
  'Visa',
  'Julia',
  'Madison',
  'WI',
  'United States'),
 (10003,
  '1/26/09 13:41',
  'Product1',
  1200,
  'Mastercard',
  'Lesleigh',
  'Baden',
  'Aargau',
  'Switzerland'),
 (10004,
  '1/20/09 10:42',
  'Product2',
  3600,
  'Diners',
  'esther',
  'Huddersfield',
  'England',
  'United Kingdom'),
 (10005,
  '1/22/09 14:25',
  'Product1',
  1200,
  'Visa',
  'Hans-Joerg',
  'Belfast',
  'Northern Ireland',
  'United Kingdom'),
 (10006,
  '1/28/09 5:36',
  'Product2',
  3600,
  'Visa',
  'Christiane',
  'Black River',
  'Black River',
  'Mauritius'),
 (10007,
  '1/2/09 6:17',
  'Product1',
  1200,
  'Mastercard',
  'carolina',
  'Basildon',
  'England',
  'United Kingdom'),
 (10008,
  '1/2/09 4:53',
  'Product1',
  1200,
  'Visa',
  'Betina',
  'Parkville',
  'MO',
  'United States'),
 (10009,
  '1/2/09 13:08',
  'Product1',
  1200,
  'Mastercard',
  'Federica e Andrea',
  'Astoria',
  'OR',
  'United States')]

In [33]:
complete = pd.read_sql_query("SELECT * FROM sales", conn)
complete

,Product_ID,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country
0,10000,1/1/09 4:24,Product3,7500,Amex,Pamela,Skaneateles,NY,United States
1,10001,1/8/09 11:55,Product1,1200,Diners,julie,Haverhill,England,United Kingdom
2,10002,1/12/09 21:30,Product1,1200,Visa,Julia,Madison,WI,United States
3,10003,1/26/09 13:41,Product1,1200,Mastercard,Lesleigh,Baden,Aargau,Switzerland
4,10004,1/20/09 10:42,Product2,3600,Diners,esther,Huddersfield,England,United Kingdom
...,...,...,...,...,...,...,...,...,...
993,10993,1/7/09 17:48,Product1,1200,Mastercard,Alex,Augusta,GA,United States
994,10994,1/23/09 12:42,Product2,3600,Mastercard,Anke,Avalon,New South Wales,Australia
995,10995,1/7/09 19:48,Product2,3600,Mastercard,TRICIA,Sydney,New South Wales,Australia
996,10996,1/26/09 11:19,Product1,1200,Mastercard,smith,Lahti,Etela-Suomen Laani,Finland
997,10997,1/5/09 13:23,Product1,1200,Visa,Macy,Inner City,Vienna,Austria

In [47]:
cursor.execute("SELECT * FROM sales")
list = cursor.fetchmany(10)

In [38]:
for sales in list:
    print(sales[0], '-', sales[1], '-', sales[2], '-', sales[3], '-', sales[4], '-', sales[5], '-', sales[6], '-', 
          sales[7], '-', sales[8])

10000 - 1/1/09 4:24 - Product3 - 7500 - Amex - Pamela - Skaneateles - NY - United States
10001 - 1/8/09 11:55 - Product1 - 1200 - Diners - julie - Haverhill - England - United Kingdom
10002 - 1/12/09 21:30 - Product1 - 1200 - Visa - Julia - Madison - WI - United States
10003 - 1/26/09 13:41 - Product1 - 1200 - Mastercard - Lesleigh - Baden - Aargau - Switzerland
10004 - 1/20/09 10:42 - Product2 - 3600 - Diners - esther - Huddersfield - England - United Kingdom
10005 - 1/22/09 14:25 - Product1 - 1200 - Visa - Hans-Joerg - Belfast - Northern Ireland - United Kingdom
10006 - 1/28/09 5:36 - Product2 - 3600 - Visa - Christiane - Black River - Black River - Mauritius
10007 - 1/2/09 6:17 - Product1 - 1200 - Mastercard - carolina - Basildon - England - United Kingdom
10008 - 1/2/09 4:53 - Product1 - 1200 - Visa - Betina - Parkville - MO - United States
10009 - 1/2/09 13:08 - Product1 - 1200 - Mastercard - Federica e Andrea - Astoria - OR - United States

In [48]:
for sales in list:
    print(sales[5], '-', sales[8])

Pamela - United States
julie - United Kingdom
Julia - United States
Lesleigh - Switzerland
esther - United Kingdom
Hans-Joerg - United Kingdom
Christiane - Mauritius
carolina - United Kingdom
Betina - United States
Federica e Andrea - United States

In [43]:
cursor.execute("SELECT * FROM sales WHERE price > 4000")
list = cursor.fetchmany(10)

In [44]:
for sales in list:
    print(sales[2], '-', sales[4])

Product3 - Amex
Product3 - Mastercard
Product3 - Mastercard
Product3 - Visa
Product3 - Visa
Product3 - Mastercard
Product3 - Visa
Product3 - Visa
Product3 - Visa
Product3 - Visa

In [49]:
cursor.execute("SELECT Name, Country FROM sales WHERE Product_ID BETWEEN 10000 AND 10009")

In [50]:
cursor.fetchall()

[('Pamela', 'United States'),
 ('julie', 'United Kingdom'),
 ('Julia', 'United States'),
 ('Lesleigh', 'Switzerland'),
 ('esther', 'United Kingdom'),
 ('Hans-Joerg', 'United Kingdom'),
 ('Christiane', 'Mauritius'),
 ('carolina', 'United Kingdom'),
 ('Betina', 'United States'),
 ('Federica e Andrea', 'United States')]

In [53]:
cursor.execute("SELECT Product, Payment_Type FROM sales WHERE Price > 4000")

In [54]:
cursor.fetchall()

[('Product3', 'Amex'),
 ('Product3', 'Mastercard'),
 ('Product3', 'Mastercard'),
 ('Product3', 'Visa'),
 ('Product3', 'Visa'),
 ('Product3', 'Mastercard'),
 ('Product3', 'Visa'),
 ('Product3', 'Visa'),
 ('Product3', 'Visa'),
 ('Product3', 'Visa'),
 ('Product1', 'Visa'),
 ('Product3', 'Mastercard'),
 ('Product3', 'Mastercard'),
 ('Product3', 'Diners'),
 ('Product3', 'Diners'),
 ('Product3', 'Visa')]

In [60]:
df_csv.shape 
#Angelo Louis L. Hizon

(992, 9)